
# BIF=build-in function 内置函数
#  python 对应的是脚本程序。python 对应的需要执行的特别的快的操作的。
# int 对应的也是一个bif的操作的。获取python的内置函数的操作
print(dir(__builtins__))
#  help(int)可以获取内置的函数的help帮助
print(help(int))
# 需要注意的是python的 concate计算的是字符串之间的增加操作实现的。字符串的拼接需要进行关注的。
print("i love  fishc"+8)
# 基础的数据结构知识：变量和字符串。
#python 对应的不是将值赋值给了变量而已，更加确切的说法是，pyhon对应的更多的是将名字贴到了变量上面。将名字贴到变量上面的。
#python 变量的使用之前需要进行赋值和初始化的操作的。python变量取名称的时候需要含义的。


# 字符串的操作方式和理解实现： 单双引号之间进行交叉操作的话，可以使用转义字符进行处理。还可以使用原始字符串(对应的即在字符串的前面增加r作为原始字符串的)
# 下面是原始字符串的运用，需要注意的是使用英文标点符号
str=r"C:\now"


#  while 循环
# and  操作符。


